app/controllers/admin_dashboard_controller.rb

    def view_all_users
        @users =  User.all
---
SELECT "users".* FROM "users"