app/controllers/expense_trackers_controller.rb

SELECT expense_trackers.id, expense_trackers.total_budget, expense_trackers.itinerary_id, expense_trackers.accommodation, expense_trackers.transportation, expense_trackers.meal, expense_trackers.other, itineraries.description FROM "expense_trackers" inner join itineraries on itineraries.id = expense_trackers.itinerary_id ORDER BY expense_trackers.itinerary_id ASC
---
    def index
        @expense_lists = ExpenseTracker
        .joins("inner join itineraries on itineraries.id = expense_trackers.itineraries_id")
        .select("expense_trackers.id, expense_trackers.total_budget, expense_trackers.itineraries_id, expense_trackers.accommodation, expense_trackers.transportation, expense_trackers.meal, expense_trackers.other, expense_trackers.remaining_budget, itineraries.description")
        .order("expense_trackers.itineraries_id ASC")

INSERT INTO "expense_trackers" ("total_budget", "itinerary_id", "itinerary_description", "accommodation", "transportation", "meal", "other", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @expense_tuple = ExpenseTracker.new(expense_params)
        if @expense_tuple.save

SELECT expense_trackers.id, expense_trackers.total_budget, expense_trackers.itinerary_id, expense_trackers.accommodation, expense_trackers.transportation, expense_trackers.meal, expense_trackers.other, itineraries.description FROM "expense_trackers" inner join itineraries on itineraries.id = expense_trackers.itinerary_id WHERE "expense_trackers"."id" = $1 ORDER BY expense_trackers.itinerary_id ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_expense_tuple_with_id
        @expense_tuple = ExpenseTracker
        .joins("inner join itineraries on itineraries.id = expense_trackers.itineraries_id")
        .select("expense_trackers.id AS id, expense_trackers.total_budget, expense_trackers.itineraries_id, expense_trackers.accommodation, expense_trackers.transportation, expense_trackers.meal, expense_trackers.other, expense_trackers.remaining_budget, itineraries.description")
        .order("expense_trackers.itineraries_id ASC").find(params[:id])