app/controllers/itineraries_controller.rb

SELECT "itineraries".* FROM "itineraries"
SELECT "itineraries".* FROM "itineraries" ORDER BY "itineraries"."datetime" DESC
---
  def index
    @itineraries = Itinerary.all
    @itineraries = Itinerary.order(datetime: :asc)

INSERT INTO "itineraries" ("description", "location", "datetime", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Go workout"], ["location", "Vancouver"], ["datetime", "2023-10-18 16:00:00"], ["created_at", "2023-10-30 10:51:22.787163"], ["updated_at", "2023-10-30 10:51:22.787163"]]
---
  def create
    @itinerary = Itinerary.new(itinerary_params)

    respond_to do |format|
      if @itinerary.save

UPDATE "itineraries" SET "description" = $1, "updated_at" = $2 WHERE "itineraries"."id" = $3  [["description", "Go to work"], ["updated_at", "2023-10-30 10:17:53.990632"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @itinerary.update(itinerary_params)

DELETE FROM "itineraries" WHERE "itineraries"."id" = $1  [["id", 1]]
---
  def destroy
    @itinerary.destroy

SELECT "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_itinerary
      @itinerary = Itinerary.find(params[:id])