app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("description", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "study"], ["completed", false], ["created_at", "2023-10-25 01:41:18.358141"], ["updated_at", "2023-10-25 01:41:18.358141"]]

  def update
    respond_to do |format|
      if @list.update(list_params)
---
UPDATE "lists" SET "description" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["description", "study hehe"], ["updated_at", "2023-10-25 01:47:06.925503"], ["id", 2]]

  def destroy
    @list.destroy
---
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 1]]