app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" ORDER BY created_at DESC
---
    def index
        @notes = Note.all.order("created_at DESC")

INSERT INTO "notes" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "my first post"], ["content", "this is my first post"], ["created_at", "2023-10-29 04:50:11.004353"], ["updated_at", "2023-10-29 04:50:11.004353"]]
---
    def create
        @note = Note.new(note_params)

        if @note.save

SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "notes"."id" = $4  [["title", "my first post with update"], ["content", "this is my first post with update"], ["updated_at", "2023-10-29 05:22:39.481439"], ["id", 1]]
---
    def update
        @note = Note.find(params[:id])

        if @note.update(note_params)

SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @note = Note.find(params[:id])