app/controllers/registrations_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "kbakshi@sfu.ca"], ["password_digest", "[FILTERED]"], ["admin", false], ["created_at", "2023-10-11 07:45:11.010985"], ["updated_at", "2023-10-11 07:45:11.010985"]]