app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "kbakshi@sfu.ca"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "tripmate@gmail.com"], ["LIMIT", 1]]
---
    def create
      user = User.find_by(email: params[:email])

      if user.present? && user.authenticate(params[:password])